#+options: ^:{}
#+options: toc:nil
#+setupfile: ../info/index-bigblow-header.setup
#+include: ../info/common-header.org
#+TITLE: 簡約と行列
#+AUTHOR: 鈴木正幸，岩手大学・非常勤講師

#+LATEX_CLASS: jarticle
#+LATEX_CLASS_OPTIONS: [dvipdfmx,11pat]

#+BIND: org-latex-image-default-width 0.8\linewidth

#+LATEX_HEADER:\setlength{\textwidth}{18cm}
#+LATEX_HEADER:\setlength{\oddsidemargin}{-1cm}
#+LATEX_HEADER:\setlength{\evensidemargin}{-1cm}
#+LATEX_HEADER:\setlength{\topmargin}{-2cm}
#+LATEX_HEADER:\setlength{\textheight}{26cm}


* ガウス消去

** 連立一次方程式

  \begin{eqnarray}
  x+y+z & = & 3 \\
  x-y-z & = & -1 \\
  x-y+z & = & 1 \\
  \end{eqnarray}
  
** 行列による表現
   
   \begin{array}{rrrr|l}
   x & y & z & c & \\\hline
   1 & 1 & 1 & -3 & x+y+z-3=0 \\
   1 & -1 & -1 & 1 & x -y -z + 1 = 0\\
   1 & -1 & 1 & -1  & x - y +z - 1 =0\\
   \end{array}

\( x \) を \(-y-z+3 \) で置き換える. 順序の高変数を，順序の低い変数か
成る等式で置き換える。

行列操作でいうと，1行目の横ベクトル定数倍して，他の行から引いたベクト
ルで置き換える:

   \begin{array}{rrrr|l}
   x & y & z & c   \\ \hline
   1 & 1 & 1 & -3    & x+y+z-3=0 \\
   0 & -2 & -2 & 4 & -2y-2z+4=0\\
   0 & -2 & 0 &  2 & -2y+2=0  \\
   \end{array}


2行目を -2で割って，3行目を-2 で割っても解は変らないので，
 
   \begin{array}{rrrr|l}
   x & y & z & c   \\ \hline
   1 & 1 & 1 & -3    & x+y+z-3=0 \\
   0 & 1 & 1 & -2 & y+z-2=0\\
   0 & 1 & 0 & -1 & y-1=0  \\
   \end{array}

3行目を \( y = -z+2 \) で置き換える
   
   \begin{array}{rrrr|l}
   x & y & z & c & 意味  \\ \hline
   1 & 1 & 1 & -3 & x + y+ z -3 = 0  \\
   0 & 1 & 1 & 2 & y + z - 2 =0 \\
   0 & 0 & -1 & -1 & -z = -1 \\
   \end{array}

3行目を-1で割って，3角行列ができる。

   \begin{array}{rrrr|l}
   x & y & z & c &  \\ \hline
   1 & 1 & 1 & -3 & x+y+z=3  \\
   0 & 1 & 1 & -2 & y+z=2\\
   0 & 0 & 1 & -1 & z= 1\\
   \end{array}

 後退消去して，

   \begin{array}{rrrr|l}
   x & y & z & c &  \\ \hline
   1 & 0 & 0 & 1 & x = 1  \\
   0 & 1 & 0 & 1 & y = 1\\
   0 & 0 & 1 & 1 & z= 1\\
   \end{array}

   

* グレブナー基底計算と行列   
   

 \begin{eqnarray}
 f1: x^3 - 3 x^2 -y + 1 = 0\\
 f2: -x^2 + y^2 - 1 =0
 \end{eqnarray}

 の解を求めたい。
 

   \begin{array}{rrrrrr|l}
   x^3 & x^2 & x & y^2 & y  & c & 意味  \\ \hline
   1   & -3  & 0 & 0   & -1 & 1 &  x^3 - 3 x^2 -y + 1 = 0\\
   0   & -1  & 0 & 1   & 0  & -1 & -x^2 + y^2 - 1 =0 \\
   \end{array}


   \begin{array}{rrrrrr|l}
   x^3 & x^2 & x & y^2 & y  & c & 意味  \\ \hline
   1   & -3  & 0 & 0   & -1 & 1 &  f1: x^3 - 3 x^2 -y + 1 = 0\\
   0   & -1  & 0 & 1   & 0  & -1 & f2: -x^2 + y^2 - 1 =0 \\
   \end{array}


\(f2:  x^2 = y^2 - 1 \)  の関係を用いて，
 \(f1:  x^3 = 3 x^2 + y - 1  \) の関係を簡約する。

 \(f1-f2:  (x^3 = 3 x^2 + y -1) - (x^3 = x y^2 - x) \)

 \(f3: 0 = 3 x^2 - x y^2 + x + y -1 \)

 \[
   \begin{array}{rrrrrrr|l}
   x^3 & x^2 &  x y^2 & x  & y^2 & y  & c & 意味  \\ \hline
   1   & -3  &     0  & 0  & 0   & -1 & 1 & f1: x^3 - 3 x^2 -y + 1 = 0\\
   0   & -1  &     0  & 0  & 1   & 0  & -1& f2: -x^2 + y^2 - 1 =0 \\
   0   & 3   &    -1  & 1  & 0   & 1  & -1& f3: 0 = 3 x^2 - x y^2 + x + y -1\\
   \end{array}
 \]

 f3の式は，f2でそのまま簡約できる \(f4 = f3+3 f2\)
 \(f4: (3x^2 -xy^2 + x + y -1) -3(x^2 -y^2+1) \)
 \(f4: -xy2+x+y2

 \[
   \begin{array}{rrrrrrr|l}
   x^3 & x^2 &  x y^2 & x  & y^2 & y  & c & 意味  \\ \hline
   1   & -3  &     0  & 0  & 0   & -1 & 1 & f1: x^3 - 3 x^2 -y + 1 = 0\\
   0   & -1  &     0  & 0  & 1   & 0  & -1& f2: -x^2 + y^2 - 1 =0 \\
   0   & 3   &    -1  & 1  & 0   & 1  & -1& f3: 0 = 3 x^2 - x y^2 + x + y -1\\
  
   \end{array}
 \]


 \[
   \begin{array}{rrrrrrrrr|l}
   x^2 &  xy &  x  & y^5 & y^4 & y^3  & y^2 & y & c   & 意味  \\ \hline
   1   &   0 &  0  & 0   & 0   & 0    & -1  & 0 &  1  & f2: x^2 - y^2+1 =0 \\
   0   &   1 &  -1 & 0   & -1  & 0    & 11  & 3 & -13 & f7: xy - x -y^4 +11y^2 +3y -13\\
   0   &   0 &  0  & 1   & 1   & -11  & -17 & 9 & 17  & f8: y^5 + y^4 -11y^3 -17y^2+9y+17\\
  
   \end{array}
 \]




#+BEGIN_SRC sage
x, y = QQ['x,y'].gens()
#+END_SRC

#+RESULTS:


$x_1, x_2, x_3$を使って多項式を定義する:
#+BEGIN_SRC sage
f_1 = x^3 -3*x^2 - y + 1; f_1
f_2 = x^2 -y^2 +1; f_2
f_3 = f_1 - x*f_2; f_3
f_4 = -f_3-3*f_2; f_4
f_5 = f_3+f_4; f_5
f_6 = f_2*y^2 -x*f_3; f_6
f_7 = f_6 - 3*f_1 -10*f_2; f_7
f_8 = f_7*x-y*f_2; f_8

#+END_SRC

#+RESULTS:
: x^3 - 3*x^2 - y + 1
: x^2 - y^2 + 1
: x*y^2 - 3*x^2 - x - y + 1
: -x*y^2 + 3*y^2 + x + y - 4
: -3*x^2 + 3*y^2 - 3
: -y^4 + 3*x^3 + x^2 + x*y + y^2 - x
: -y^4 + x*y + 11*y^2 - x + 3*y - 13
: -x*y^4 + 11*x*y^2 + y^3 - x^2 + 3*x*y - 13*x - y


$f_1$, $f_2$, $f_3$ を基底とするイデアル $I$ を生成する:
#+BEGIN_SRC sage
I = ideal(f_1, f_2, f_3)
I
#+END_SRC

#+RESULTS:
: Ideal (x^3 - 3*x^2 - y + 1, x^2 - y^2 + 1, x*y^2 - 3*x^2 - x - y + 1) of Multivariate Polynomial Ring in x, y over Rational Field

